{
  "4": "nv: Melanocytic nevi\nMelanocytic nevi are commonly known as moles. They are usually benign proliferations of melanocytes that appear as small, well-defined, uniformly colored spots. Most nevi are harmless, though they are often monitored for any changes over time. They can vary in size, shape, and color, but typically maintain smooth borders and consistent pigmentation.",
  "5": "mel: Melanoma\nMelanoma is a malignant tumor arising from melanocytes and is considered the most dangerous form of skin cancer. It often presents as an irregular, asymmetrical lesion with varied colors and uneven borders. Early detection is crucial, as melanoma can rapidly metastasize if not treated promptly. Clinical features such as rapid change in size, shape, or color are red flags for melanoma. Preventative measures include regular skin checks and prompt evaluation of suspicious lesions.",
  "2": "bkl: Benign keratosis-like lesions\nBenign keratosis-like lesions, also known as seborrheic keratoses, are noncancerous growths that often appear as warty, stuck-on, or waxy lesions. They typically develop in older adults and can occur anywhere on the body. Although they are benign, their appearance can sometimes mimic malignant lesions, making clinical evaluation important. They are usually removed only for cosmetic reasons or if they become irritated.",
  "1": "bcc: Basal cell carcinoma\nBasal cell carcinoma (BCC) is the most common form of skin cancer, arising from the basal cells in the epidermis. BCC typically appears as a pearly, translucent papule with rolled edges, often accompanied by telangiectasia. While it grows slowly and rarely metastasizes, it can cause significant local tissue damage if left untreated. Early diagnosis and treatment are essential to prevent extensive tissue destruction and scarring.",
  "0": "akiec: Actinic keratoses\nActinic keratoses are precancerous lesions that result from chronic sun exposure. They usually appear as rough, scaly patches on sun-exposed areas like the face, ears, and arms. Although most actinic keratoses remain benign, they carry a risk of progressing to squamous cell carcinoma over time. Regular monitoring and treatment can reduce the risk of malignant transformation.",
  "6": "vasc: Vascular lesions\nVascular lesions are skin abnormalities that arise from blood vessels. They include conditions like hemangiomas, which are benign growths, and other types such as pyogenic granulomas. These lesions often appear as red or purple marks on the skin and can vary in size and shape. While many vascular lesions are harmless, some may require treatment if they bleed, become painful, or cause cosmetic concerns.",
  "3": "df:Dermatofibromas\n Dermatofibromas are benign, firm skin nodules that typically occur on the lower extremities. They are thought to be a reactive process to minor skin injury rather than true tumors. Dermatofibromas are usually asymptomatic and slow-growing, although they can sometimes be mistaken for malignant lesions due to their irregular shape. They generally do not require treatment unless they become irritated or for cosmetic reasons."
}